InformationRegisters/УченыеЗванияФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УченыеЗванияФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УченоеЗвание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УченыеЗвания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрисвоенияУченогоЗвания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АттестатСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АттестатНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АттестатВыданОрганизация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаучнаяСпециальность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УченыеЗванияФизическихЛиц/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ФизическоеЛицо", "ОбщиеДанные");
КонецПроцедуры

#КонецОбласти

// Заполняет ученые звания физического лица.
// 
// Параметры:
//  ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//  УченыеЗвания - Массив из Структура - см. НовоеУченоеЗвание
Процедура ЗаполнитьУченыеЗванияФизическогоЛица(ФизическоеЛицо, УченыеЗвания) Экспорт
	
	Если УченыеЗвания.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.УченыеЗванияФизическихЛиц.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ФизическоеЛицо);
	НаборЗаписей.Прочитать();
	
	Для Каждого ТекущаяСтрока Из УченыеЗвания Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекущаяСтрока);
		НоваяЗапись.ФизическоеЛицо = ФизическоеЛицо;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Создает новую структуру для сведений об ученом звании.
// 
// Возвращаемое значение:
//  Структура:
//   * ФизическоеЛицо		- СправочникСсылка.ФизическиеЛица -
//   * НомерПоПорядку 		- Число -
//   * УченоеЗвание 		- СправочникСсылка.УченыеЗвания -
//   * НаучнаяСпециальность - СправочникСсылка.КлассификаторСпециальностейПоОбразованию -
//   * АттестатСерия 		- Строка -
//   * АттестатНомер 		- Строка -
//   * АттестатВыданОрганизация		- Строка -
//   * ДатаПрисвоенияУченогоЗвания	- Дата -
Функция НовоеУченоеЗвание() Экспорт
	Возврат ОбщегоНазначенияБЗК.СтруктураПоИмениРегистраСведений("УченыеЗванияФизическихЛиц");
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредставлениеУченогоЗванияФизическогоЛица(ФизическоеЛицоСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УченыеЗванияФизическихЛиц.ФизическоеЛицо КАК ФизическоеЛицо1,
		|	УченыеЗванияФизическихЛиц.НомерПоПорядку,
		|	УченыеЗванияФизическихЛиц.УченоеЗвание,
		|	УченыеЗванияФизическихЛиц.ДатаПрисвоенияУченогоЗвания,
		|	УченыеЗванияФизическихЛиц.АттестатСерия,
		|	УченыеЗванияФизическихЛиц.АттестатНомер,
		|	УченыеЗванияФизическихЛиц.АттестатВыданОрганизация,
		|	УченыеЗванияФизическихЛиц.НаучнаяСпециальность
		|ИЗ
		|	РегистрСведений.УченыеЗванияФизическихЛиц КАК УченыеЗванияФизическихЛиц
		|ГДЕ
		|	УченыеЗванияФизическихЛиц.ФизическоеЛицо = &ФизическоеЛицоСсылка";
		
	Запрос.УстановитьПараметр("ФизическоеЛицоСсылка", ФизическоеЛицоСсылка);
	
	Возврат ПредставлениеУченогоЗванияПоКоллекцииЗаписей(Запрос.Выполнить().Выгрузить());
	
КонецФункции

Функция ПредставлениеУченогоЗванияПоКоллекцииЗаписей(НаборЗаписей) Экспорт
	
	ПредставлениеУченыеЗвания = "";
	
	ПоследнееУченоеЗвание = Неопределено;
	Для Каждого СтрокаУченыеЗвания Из НаборЗаписей Цикл
		Если ПоследнееУченоеЗвание = Неопределено ИЛИ ПоследнееУченоеЗвание.ДатаПрисвоенияУченогоЗвания < СтрокаУченыеЗвания.ДатаПрисвоенияУченогоЗвания Тогда
			ПоследнееУченоеЗвание = СтрокаУченыеЗвания;
		КонецЕсли; 
	КонецЦикла;
	
	Если ПоследнееУченоеЗвание <> Неопределено Тогда
		ПредставлениеУченыеЗвания 	= ?(ЗначениеЗаполнено(ПоследнееУченоеЗвание.УченоеЗвание), Строка(ПоследнееУченоеЗвание.УченоеЗвание), "");
		ПредставлениеУченыеЗвания = ПредставлениеУченыеЗвания + ?(ЗначениеЗаполнено(ПоследнееУченоеЗвание.НаучнаяСпециальность), ?(ПустаяСтрока(ПредставлениеУченыеЗвания), "", ", ") + Строка(ПоследнееУченоеЗвание.НаучнаяСпециальность), "");
		ПредставлениеУченыеЗвания = ПредставлениеУченыеЗвания + ?(ЗначениеЗаполнено(ПоследнееУченоеЗвание.ДатаПрисвоенияУченогоЗвания), ?(ПустаяСтрока(ПредставлениеУченыеЗвания), "", ", ") + Формат(ПоследнееУченоеЗвание.ДатаПрисвоенияУченогоЗвания, "ДЛФ=D"), "");
	КонецЕсли;
	
	Если ПустаяСтрока(ПредставлениеУченыеЗвания) Тогда
		ПредставлениеУченыеЗвания = НСтр("ru = 'Ученые звания не присваивались'");
	КонецЕсли; 
	
	Возврат ПредставлениеУченыеЗвания;
	
КонецФункции

#КонецОбласти

#КонецЕсли
